Revit 2024 API
BuiltInFailures.StairRampFailures.WinderTooManyParallelTreadsAtEndFailure Property
 The number of parallel treads at end is too great.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId WinderTooManyParallelTreadsAtEndFailure { get; }
Visual Basic
Public Shared ReadOnly Property WinderTooManyParallelTreadsAtEndFailure As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ WinderTooManyParallelTreadsAtEndFailure {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace